In [1]:
import sqlite3
import lifelines
import pandas as pd
import matplotlib.pyplot as plt
from lifelines import KaplanMeierFitter
import warnings
warnings.filterwarnings('ignore')

conn = sqlite3.connect("../data/sample_20210509.sqlite")

In [15]:
df = pd.read_sql_query("""
    SELECT 
        name
    FROM ranking
    -- where name like '%[0-9]'
""", conn)
df

         name
0     Unlucky
1        Babo
2        Nude
3     JayChou
4    Zeretius
..        ...
995    Lawkes
996     Troyy
997   Liridas
998  Footwear
999   PennyXx

[1000 rows x 1 columns]

In [23]:
df[df.name.apply(lambda x: x[-1].isdigit())].name.values

array(['TicTacToe3', '9812', 'Nightmare96', 'Blu301', 'baratun1',
       'LilTay420', 'Niko28', 'penguinvivi2', 'AlterEg0', 'Stoners95',
       'ElBrujo18', 'Gamecube945', 'SIm13', 'Menche13', 'avoxo0',
       'healer37', 'APRMule1', 'ayshays22', 'Ladyluck1', 'Shaggyx3',
       'RawrPanda96', 'mage1', 'shadowchild5', 'sputnik666', 'Lojista1',
       'Brownie1', 'Beep0', 'Gruncle2', 'LiLAzNb0i24', 'Joonas47',
       'DarkNight01', 'HotBabe69', 'Shu31', 'ConCho123', 'VonLeon96',
       'Suspect79', 'KDTrey6', 'buttcrak360', 'Luuk951', 'DefScrolls1',
       'black2034', 'Wizard101', 'MrMuIe2', 'ShivFAME193', 'ShivFAME196',
       'ShivFAME199', 'ShivFAME202', 'luck17', 'luck18', 'GunNEkuDea01',
       'sfmsfm084', 'afo32', 'Idoco23', 'Pie260', 'Donor94',
       'StoreYouAh2', 'Netto1', 'Alan715', '0100', 'Munklemule6',
       'Parkdragon2', 'Amitrot100', 'Reo01', 'Mule920', 'famed39',
       'famed50', 'charliebb55'], dtype=object)